app/controllers/api/projects_controller.rb

INSERT INTO "projects" ("title", "description", "about_students", "teacher_id", "goal", "created_at", "updated_at", "blurb") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "categories".* FROM "categories" WHERE "categories"."category" = $1 LIMIT $2  [["category", "Books"], ["LIMIT", 1]]
INSERT INTO "category_associations" ("project_id", "category_id") VALUES ($1, $2) RETURNING "id"  [["project_id", 47], ["category_id", 157]]
---
    def create
        @project = Project.new(project_params)
        @project.teacher_id = current_user.teacher_id

        if @project.save
            if params[:categories].is_a?(Array)
                params[:categories].each do |category_id|
                    CategoryAssociation.create( project_id: @project.id, category_id: category_id)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2, $3)  [["id", 157], ["id", 163], ["id", 165]]
SELECT "donations".* FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 44]]
SELECT "schools".* FROM "schools" WHERE "schools"."id" = $1  [["id", 51]]
---
    def show
        @project = Project.includes(:school, :teacher, :donations, :categories).find(params[:id])