app/controllers/api/schools_controller.rb

    def index
        @schools = School.all
---
SELECT  "schools".* FROM "schools" ORDER BY "schools"."id" ASC LIMIT $1  [["LIMIT", 1]]