app/controllers/api/teachers_controller.rb

SELECT "schools".* FROM "schools"
---
    def new
        @schools = School.all

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "user9"], ["created_at", "2020-04-07 20:34:48.326390"], ["updated_at", "2020-04-07 20:34:48.326390"]]
INSERT INTO "teachers" ("full_name", "teacher_name", "school_id", "created_at", "updated_at", "honorific") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["full_name", "user9"], ["teacher_name", "Smith"], ["school_id", 5], ["created_at", "2020-04-07 20:34:48.336556"], ["updated_at", "2020-04-07 20:34:48.336556"], ["honorific", "Mrs."]]
INSERT INTO "teachers" ("full_name", "teacher_name", "school_id", "created_at", "updated_at", "honorific") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["full_name", "user10"], ["teacher_name", "Smith"], ["school_id", 12], ["created_at", "2020-04-08 22:44:08.232109"], ["updated_at", "2020-04-08 22:44:08.232109"], ["honorific", "Coach"]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "user10"], ["created_at", "2020-04-08 22:44:08.220119"], ["updated_at", "2020-04-08 22:44:08.220119"]]
INSERT INTO "teachers" ("full_name", "teacher_name", "school_id", "created_at", "updated_at", "honorific") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["full_name", "asdf"], ["teacher_name", "Kotch"], ["school_id", 12], ["created_at", "2020-04-09 19:36:31.793414"], ["updated_at", "2020-04-09 19:36:31.793414"], ["honorific", "Mrs."]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "asdf"], ["created_at", "2020-04-09 19:36:31.783846"], ["updated_at", "2020-04-09 19:36:31.783846"]]
---
    def create
        @user = User.new(user_params)
        @teacher = Teacher.new(teacher_params)


        if  !@user.valid?
            @user.save
            render json: {user: @user.errors.full_messages}, status: 422
        elsif !@teacher.valid?
            @teacher.save
            render json: {teacher: @teacher.errors.full_messages}, status: 422
        elsif  @user.save && @teacher.save
            @user.teacher_id = @teacher.id
            @user.is_teacher = true
            @user.save