app/views/api/projects/show.json.jbuilder

SELECT "teachers"."id" FROM "teachers" WHERE "teachers"."school_id" = $1  [["school_id", 54]]
---
    json.extract! @project.school, :id, :name, :city, :state, :zip, :latitude, :longitude, :grade_range
    json.teacherIds @project.school.teachers.pluck(:id)