app/controllers/teachers_controller.rb

SELECT "schools".* FROM "schools"
---
    def new
        @schools = School.all

INSERT INTO "users" ("email", "is_teacher", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "user4"], ["is_teacher", true], ["created_at", "2020-04-07 18:10:42.699578"], ["updated_at", "2020-04-07 18:10:42.699578"]]
INSERT INTO "teachers" ("full_name", "teacher_name", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "user4"], ["teacher_name", "Mrs. Kotch"], ["school_id", 4], ["created_at", "2020-04-07 18:10:42.803530"], ["updated_at", "2020-04-07 18:10:42.803530"]]
INSERT INTO "teachers" ("full_name", "teacher_name", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "User2"], ["teacher_name", "Mrs. Kotch"], ["school_id", 5], ["created_at", "2020-04-07 19:46:48.447471"], ["updated_at", "2020-04-07 19:46:48.447471"]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "user2@gmail.com"], ["created_at", "2020-04-07 19:46:48.440786"], ["updated_at", "2020-04-07 19:46:48.440786"]]
INSERT INTO "teachers" ("full_name", "teacher_name", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "user 8"], ["teacher_name", "John Smith"], ["school_id", 4], ["created_at", "2020-04-07 19:30:46.815636"], ["updated_at", "2020-04-07 19:30:46.815636"]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "user 8"], ["created_at", "2020-04-07 19:30:46.810187"], ["updated_at", "2020-04-07 19:30:46.810187"]]
---
    def create
        @user = User.new(user_params)
        @teacher = Teacher.new(teacher_params)

        if  !@user.valid?
            @user.save
            render json: {user: @user.errors.full_messages}, status: 422
        elsif !@teacher.valid?
            @teacher.save
            render json: {teacher: @teacher.errors.full_messages}, status: 422
        elsif  @user.save && @teacher.save
            @user.teacher_id = @teacher.id
            @user.is_teacher = true
            @user.save