app/controllers/api/auto/schools_controller.rb

    def show
        searchText = "%"+params[:searchText].downcase+"%"
        @schools =  School
                    .where("LOWER(name) like ?", searchText)
                    .or(School.where("LOWER(city) like ?", searchText))
                    .order(:name)
                    .limit(5)
---
SELECT  "schools".* FROM "schools" WHERE ((LOWER(name) like '%tow%') OR (LOWER(city) like '%tow%')) ORDER BY "schools"."name" ASC LIMIT $1  [["LIMIT", 5]]